content/topics/kubernetes.md
+++
title = "Kubernetes"
draft = false
+++

## Articles {#articles}

-   2022-11-14 ◦ [GitHub - javiramos1/CKAD-exercises: A set of exercises to prepare for Certified Kubernetes Application Developer exam by Cloud Native Computing Foundation](https://github.com/javiramos1/CKAD-exercises)
-   2022-10-06 ◦ [Kubernetes Hardening Guidance](https://media.defense.gov/2022/Aug/29/2003066362/-1/-1/0/CTR_KUBERNETES_HARDENING_GUIDANCE_1.2_20220829.PDF)
-   2022-09-30 ◦ [Kubernetes Security: 10 Best Practices from the Industry and Community](https://dev.to/castai/kubernetes-security-10-best-practices-from-the-industry-and-community-1bp6)


### Benefits {#benefits}

-   2022-12-20 ◦ [Top 7 Benefits of Kubernetes | IBM](https://www.ibm.com/cloud/blog/top-7-benefits-of-kubernetes)

    > In fact, Kubernetes is the fastest growing project in the history of open-source software, after Linux. According to a 2021 study by the Cloud Native Computing Foundation (CNCF), from 2020 to 2021, the number of Kubernetes engineers grew by 67% to 3.9 million. That’s 31% of all backend developers, an increase of 4 percentage points in a year.


### Deployment {#deployment}

-   2022-10-19 ◦ [Helm und Helmfile — Dynamisches Duo für automatisierte Kubernetes-Deployments](https://www.innoq.com/de/articles/2022/10/helm-und-helmfile/)


### Golang {#golang}

-   2022-10-24 ◦ [Dockerize a GoLang HTTP server and deploy it on Kubernetes](https://dev.to/aksrao1998/dockerize-a-golang-http-server-and-deploy-it-on-kubernetes-592j)


### Security {#security}

-   2022-12-20 ◦ [Security implications of Kubernetes operators | Snyk](https://snyk.io/blog/security-implications-of-kubernetes-operators/)
-   2022-12-20 ◦ [Infrastructure security advantages of leveraging Kubernetes - Bridgecrew Blog](https://bridgecrew.io/blog/advantages-of-kubernetes-infrastructure-security/)
